[
    "...that the nickname for <a href='Nekori64'>Nekori</a>'s <a href='TheCeleryPC'>eMachines ET1810</a> is due to its processor?",
    "...that several <a href='Nekori_Arctic'>Arctic</a> builds were 32-bit until development was reset due to issues with 32-bit protected mode?",
    "...that <a href='Horicraft'>the original Horicraft</a> was originally known as StuffyCraft?",
    "...that the <a href='StuffyXP'>StuffyXP</a> channel was once overtaken by Stuffy 64 in subscribers?",
    "...that <a href='HoriServer'>HoriServer (1)</a> still exists on Stoat but is unused?",
    "...that <a href='Nekori64'>Nekori</a> left Discord in February 2025 due to mental health issues?",
    "...that <a href='Nekori64'>Nekori</a>'s first StuffyXP video was recorded on Windows 8.1 but edited on Windows Vista and Windows 7?",
    "...that <a href='A_VMware_First-Timer_installs_Windows_XP!'>A VMware First-Timer installs Windows XP!</a> had to be delayed multiple times due to <span id='rli'>real-life issues?</span><div class='mdl-tooltip mdl-tooltip--top' data-mdl-for='rli'>Specifically, it was due to LexNova's power outlet being damaged, the original project file being corrupted, and operating system re-installs.</div><style>.mdl-tooltip-{width:300%!important;}</style>",
    "...that the <a href='KayAurora_and_Nekori_collab'>YouTube collab</a> between <a href='Nekori64'>Nekori</a> and <a href='KayAurora'>Kay</a> was originally going to be edited by Nekori?",
    "...that a Windows 2000-inspired <a href='Arctic32'>Arctic32</a> branding pack was made by Lex and included SKUs such as <b>Professional Plus</b>?",
    "...that the <a href='KuroWiki'>KuroWiki</a> Engine is a fork of <a href='HoriWebsite'>HoriWebsite</a>?",
    "...that <a href='HoriWebsite'>HoriWebsite</a> continues the version scheming of <a href='StuffyXP_Website'>StuffyXP Website</a>, despite being rewritten until <a href='LexSite'>LexSite</a> reset the version scheme?",
    "...that the full version of the Horibyte alias was Horizon Byte?",
    "...that <a href='TheCeleryPC'>TheCeleryPC</a> originally came with Windows Vista Home Basic but was given to <a href='Nekori64'>Nekori</a> with Windows 7?",
    "...that the first program <a href='Nekori64'>Nekori</a> installed on <a href='Thei5Lappy'>Thei5Lappy</a> was Geometry Dash?",
    "...that <a href='Geometry_Dash_...on_Windows_Vista!?'>Geometry Dash...on Windows Vista!?</a> was striked down twice?",
    "...that a blog was once planned to be added to the <a href='Solarix_Website#BWTech.ml' target='_blank' rel='noopener noreferrer'>Solarix Website</a> in mid-2018?",
    "...that initial plans for <a href='MidoriMC' target='_blank' rel='noopener noreferrer'>AxeonMC</a> (MidoriMC) have existed as early as mid-2019?",
    "...that <a href='VMwares_Early_Days...(1.0-294)'>VMware's Early Days...</a> was supposed to be the last <a href='StuffyXP'>StuffyXP</a> video?",
    "...that KuroWiki Beta 3 and Beta 4 never had public releases?",
    "...that the <a href='Lynxmic_Blog'>Lynxmic Blog</a>'s GitHub Repository existed as early as January 2021?"
]
